### Agenda : Grouping DataFrames

In [149]:
import pandas as pd
import numpy as np

In [150]:
cricket_players = {
    'player_name': ['Sachin', 'Afridi', 'Jaysurya', 'Ponting','Warne','Jadeja'],
    'runs': [100, 20, 200, 100,199, 30],
    'country': ['IND', 'PAK', 'SRI', 'AUS','AUS' ,'IND'],
    'year_of_birth': [1980, 1982, 1970, 1983,1965, 1969]
}

In [151]:
df = pd.DataFrame(cricket_players)

In [152]:
df

  player_name  runs country  year_of_birth
0      Sachin   100     IND           1980
1      Afridi    20     PAK           1982
2    Jaysurya   200     SRI           1970
3     Ponting   100     AUS           1983
4       Warne   199     AUS           1965
5      Jadeja    30     IND           1969

In [180]:
df.iloc[df['year_of_birth'].idxmax()]

player_name      Ponting
runs                 100
country              AUS
year_of_birth       1983
Name: 3, dtype: object

In [181]:
df['country'].unique()

array(['IND', 'PAK', 'SRI', 'AUS'], dtype=object)

In [184]:
grouped_data = df.groupby('country')

In [191]:
for group_name, group_df in grouped_data:
#     print("for group:{} details are \n{}".format(group_name,group_df))
    print(df.iloc[group_df['year_of_birth'].idxmax()])

player_name      Ponting
runs                 100
country              AUS
year_of_birth       1983
Name: 3, dtype: object
player_name      Sachin
runs                100
country             IND
year_of_birth      1980
Name: 0, dtype: object
player_name      Afridi
runs                 20
country             PAK
year_of_birth      1982
Name: 1, dtype: object
player_name      Jaysurya
runs                  200
country               SRI
year_of_birth        1970
Name: 2, dtype: object

In [188]:
df

  player_name  runs country  year_of_birth
0      Sachin   100     IND           1980
1      Afridi    20     PAK           1982
2    Jaysurya   200     SRI           1970
3     Ponting   100     AUS           1983
4       Warne   199     AUS           1965
5      Jadeja    30     IND           1969